app/controllers/addresses_controller.rb

  def index
    puts "\n******** index_address ********"
    @addresses = Address.all
---
SELECT "addresses".* FROM "addresses"

  def new
    puts "\n******** new_address ********"
    @address = Address.new
    @user = User.find(current_user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 15], ["LIMIT", 1]]

  def edit
    puts "\n******** edit_address ********"
    @user = User.find(params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 15], ["LIMIT", 1]]

  def create
    puts "\n******** create_address ********"
    @address = Address.new(address_params)
    puts "*** params.inspect: #{params.inspect} ***"

    respond_to do |format|
      if @address.save
---
INSERT INTO "addresses" ("user_id", "street", "city", "state", "zip", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    puts "\n******** update_address ********"
    @user = User.find(params[:user_id])
    respond_to do |format|
      if @address.update(address_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 18], ["LIMIT", 1]]
UPDATE "addresses" SET "street" = $1, "city" = $2, "state" = $3, "zip" = $4, "updated_at" = $5 WHERE "addresses"."id" = $6  [["street", "57 Davis Avenue"], ["city", "White Plains"], ["state", "NY"], ["zip", 10605], ["updated_at", "2017-07-10 19:05:02.049149"], ["id", 2]]