app/controllers/comments_controller.rb

  def create
    puts "\n******** create_comment ********"
    @comment = Comment.new(comment_params)
    @user = User.find(session[:user_id])

    # puts "\n**** params.inspect #{params.inspect}"
    puts "**** params[:comment].inspect #{params[:comment].inspect}"
    puts "**** params[:comment][:post_id] #{params[:comment][:post_id]}"


    respond_to do |format|
      if @comment.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "comments" ("user_id", "post_id", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 3], ["post_id", 4], ["content", "mike"], ["created_at", "2017-07-07 15:27:04.705194"], ["updated_at", "2017-07-07 15:27:04.705194"]]