app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
---
  def index
    puts "\n******** index ********"
    @posts = Post.all

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 15], ["LIMIT", 1]]
---
  def show
    puts "\n******** show posts ********"
    puts "*** params.inspect: #{params.inspect} ***"
    @user = User.find(session[:user_id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 15], ["LIMIT", 1]]
---
  def new
    puts "\n******** new post ********"
    @post = Post.new
    @user = User.find(session[:user_id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    puts "\n******** edit post ********"
    @user = User.find(params[:user_id])

INSERT INTO "posts" ("user_id", "title", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["title", "Tom & Mike"], ["content", "back at it"], ["created_at", "2017-07-06 21:23:27.149168"], ["updated_at", "2017-07-06 21:23:27.149168"]]
---
  def create
    puts "\n******** create post ********"
    @post = Post.new(post_params)
    puts "*** params.inspect: #{params.inspect} ***"

    respond_to do |format|
      if @post.save

DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 1]]
---
  def destroy
    puts "\n******** delete post ********"
    @post.destroy