app/controllers/users_controller.rb

  def home
    puts "\n******** home ********"
    @users = User.all
---
SELECT "users".* FROM "users"

  def feed
    puts "\n******** feed ********"
    @user = User.find(session[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 15], ["LIMIT", 1]]

  def login
      puts "\n******** login ********"
      @user = User.where(username: params[:username]).first
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["username", ""], ["LIMIT", 1]]

  def index
    puts "\n******** index_user ********"
    @users = User.all
---
SELECT "users".* FROM "users"

  def show
    puts "*** @user.inspect, #{@user.inspect} ***"
    @post = Post.new
    @posts = @user.posts
    @addresses = Address.all
---
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."user_id" = $1 LIMIT $2  [["user_id", 10], ["LIMIT", 1]]

  def create
    puts "\n******** create_user ********"
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("email", "username", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["email", "swell@gmail.com"], ["username", "Swell04"], ["password", "swell"], ["created_at", "2017-07-05 18:44:28.553153"], ["updated_at", "2017-07-05 18:44:28.553153"]]

  def destroy
    puts "\n******** destroy_user ********"
    @user.destroy
---
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 10]]

    def set_user
        puts "\n******** set_user ********"
        @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 15], ["LIMIT", 1]]